import numpy as np

def f_ddθ1(θ1, θ2, dθ1, dθ2, u):
    return (-0.5*u - 2.4525*np.sin(θ1 - 2*θ2) + 0.5*np.sin(θ1 - θ2)*dθ2**2 + 0.25*np.sin(2*θ1 - 2*θ2)*dθ1**2 - 7.3575*np.sin(θ1) - 0.35*np.cos(θ1 - θ2)*dθ2 + 0.35*dθ1)/(0.25*np.cos(2*θ1 - 2*θ2) - 0.75)

def f_ddθ2(θ1, θ2, dθ1, dθ2, u):
    return (0.5*u*np.cos(θ1 - θ2) - 1.0*np.sin(θ1 - θ2)*dθ1**2 - 0.25*np.sin(2*θ1 - 2*θ2)*dθ2**2 + 4.905*np.sin(2*θ1 - θ2) - 4.905*np.sin(θ2) - 0.35*np.cos(θ1 - θ2)*dθ1 + 0.7*dθ2)/(0.25*np.cos(2*θ1 - 2*θ2) - 0.75)

l1 = 1
l2 = 1
g = 9.81
μ1 = 0.7
μ2 = 0.7
m1 = 1
m2 = 1
